Revit 2026 API

# SubelementTypeId Property

---

The identifier of this subelement's type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId TypeId { get; }
```
```vb
Public ReadOnly Property TypeId As ElementId
	Get
```
```cpp
public:
property ElementId^ TypeId {
	ElementId^ get ();
}
```
```fsharp
member TypeId : ElementId with get
```

#### Property Value

ElementId

Some subelements cannot have type assigned, in which case this method returns invalid element id.

#### Reference

Subelement Class

Autodesk.Revit.DB Namespace